# Install applications (casks) in the macOS /Applications directory
cask_args appdir: '/Applications'

tap "aws/tap"

# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"

# Microsoft Azure CLI 2.0
brew "azure-cli"

# Official Amazon AWS command-line interface
brew "awscli"

# GNU File, Shell, and Text utilities
brew "coreutils"

# Play, record, convert, and stream audio and video
brew "ffmpeg"

# Git extension for versioning large files
brew "git-lfs"

# Lightweight and flexible command-line JSON processor
brew "jq"

# Cryptography and SSL/TLS Toolkit
brew "openssl@3"

# Object-relational database system
brew "postgresql@17"

# Library for command-line editing
brew "readline"

# Search tool like grep and The Silver Searcher
brew "ripgrep"

# Terminal multiplexer
brew "tmux"

# Display directories as trees (with optional color/HTML output)
brew "tree"

# Download YouTube videos from the command-line
brew "yt-dlp"

# General-purpose data compression with high compression ratio
brew "xz"

# General-purpose lossless data-compression library
brew "zlib"

# ------------
# Applications
# ------------

# cask "1password"
# cask "datagrip"
# cask "firefox"
# cask "google-chrome"
cask "raycast"
cask "slack"
# cask "visual-studio-code"
